import { useNavigate } from "react-router-dom";
import { FontAwesomeIcon } from "@fortawesome/react-fontawesome";
import { faArrowLeft } from "@fortawesome/free-solid-svg-icons";

const OfferPage = () => {
  const navigate = useNavigate();

  return (
    <div className="text- my-[40px] px-[30px]">
      <div
        onClick={() => navigate("/cart")}
        className="fixed left-[20px] top-[15px] rounded-full px-[16px] py-[11px] text-xl backdrop-blur backdrop-filter"
      >
        <FontAwesomeIcon icon={faArrowLeft} />
      </div>
      Политика конфиденциальности персональных данных
      <br />
      Настоящая Политика конфиденциальности персональных данных (далее –
      Политика конфиденциальности) является публичным Договором, заключенным
      между владельцем Интернет-магазина ИП Мавлянова С.Р. (Продавец) и
      Покупателем в соответствии со ст.387 Гражданского кодекса Республики
      Казахстан, основана на Законе Республики Казахстан «О персональных данных
      и их защите», действует в отношении информации, содержащей персональные
      данные Покупателей, которую Интернет-магазин http://www.pizzeria-almaty.kz
      (далее – Интернет-магазин) может получить о Покупателях во время
      пользования ими сайтом Интернет-магазина.
      <br />
      1. Определение терминов <br />
      1.1. Персональные данные - сведения, относящиеся к определенному или
      определяемому на их основании субъекту персональных данных,
      зафиксированные на электронном, бумажном и (или) ином материальном
      носителе. <br />
      1.2. Неличные данные - сведения, которые автоматически передаются в
      процессе просмотра Покупателем рекламных блоков и при посещении страниц,
      на которых установлен статистический скрипт системы: адрес запрашиваемой
      страницы, информацию cookie, IP-адрес, информацию о браузере, реферер
      (адрес предыдущей страницы), время доступа. <br />
      1.3. Сбор персональных данных - действия, направленные на получение
      персональных данных. <br />
      1.4. Обработка персональных данных - действия, направленные на накопление,
      хранение, изменение, дополнение, использование, распространение,
      обезличивание, блокирование и уничтожение персональных данных. <br />
      1.5. Защита персональных данных - комплекс мер, в том числе правовых,
      организационных и технических, осуществляемых в целях, установленных
      Законом РК «О персональных данных и их защите». <br />
      1.6. Интернет-магазин - Интернет-сайт, расположенный на сервере в г.
      Алматы и имеющий адрес в сети Интернет http://www.aptekaplus.kz, на
      котором представлены товары, предлагаемые Покупателям для оформления
      Заказов, а также условия оплаты и доставки этих Заказов Покупателям.
      <br />
      1.7. Сервисы Интернет-сайта – все услуги, доступные для использования на
      сайте http://www.aptekaplus.kz и поддоменах. <br />
      1.8. Покупатель – пользователь Интернет-магазина. <br />
      1.9. Продавец – ИП Мавлянова С.Р., являющееся владельцем
      Интернет-магазина, ИИН 900125450992. <br />
      1.10. Cookies — это небольшие текстовые файлы, в которые браузер
      записывает данные с посещенных Покупателями сайтов. Cookies исполняют
      целый ряд функций, например, позволяют Покупателю эффективно перемещаться
      между страницами, запоминая его предпочтения, и, таким образом, улучшает
      опыт взаимодействия с Интернет-сайтом. Они также могут способствовать
      тому, что реклама, которую видит Покупатель онлайн, соответствует его
      интересам. Если не использовать cookies, то не возможно будет вообще
      купить товар в Интернет-магазине, так как вся работа корзины построена на
      сохранении данных с этих файлов. К примеру, если Покупатель выберет товар
      в Интернет-магазине, положит его в корзину и перейдет на новую страницу,
      то этот товар просто не сохранится в корзине. <br />
      1.11. IP-адрес — уникальный сетевой адрес узла в компьютерной сети,
      построенной по протоколу IP, позволяющий определить местонахождение
      Покупателя. Интернет-магазин не отслеживает местоположение, подробнее чем
      город и область. <br />
      <br />
      2. Предмет политики конфиденциальности <br />
      2.1. Настоящая Политика конфиденциальности устанавливает обязательства
      Продавца по неразглашению и обеспечению режима защиты конфиденциальности
      персональных данных, которые Покупатель предоставляет по запросу Продавца
      при регистрации на сайте Интернет-магазина и/или при оформлении заказа для
      приобретения товара. <br />
      2.2. Персональные данные, разрешённые к обработке в рамках настоящей
      Политики конфиденциальности, предоставляются Покупателем путём заполнения
      регистрационной формы на сайте Интернет-магазина и включают в себя
      следующую информацию: <br />
      2.2.1. фамилию, имя, отчество (отчество – по желанию) Покупателя; <br />
      2.2.2. контактный телефон Покупателя; <br />
      2.2.3. адрес электронной почты (e-mail); <br />
      2.2.4. адрес доставки Товара. <br />
      2.3. Любая иная персональная информация неоговоренная выше (история
      покупок, используемые браузеры и операционные системы и т.д.) также
      подлежит надежному хранению и нераспространению, за исключением случаев,
      предусмотренных в п.4.3.2. и п.4.4. настоящей Политики конфиденциальности.
      <br />
      3. Цели сбора и обработки персональных данных Покупателей <br />
      3.1. Продавец собирает, обрабатывает и хранит только те персональные
      данные, которые необходимы для предоставления Сервисов и/или приобретения
      Покупателем Товара из каталога Интернет-магазина. <br />
      3.2. Персональные данные Покупателя Продавец использует в целях: <br />
      3.2.1. идентификации Покупателя для оформления заказа и/или заключения
      Договора купли-продажи товара; <br />
      3.2.2. обработки и получения от Покупателя платежей; <br />
      3.2.3. доставки Покупателю товара; <br />
      3.2.4. предоставления Покупателю эффективной клиентской поддержки; <br />
      3.2.5. предоставления Покупателю персонализированных Сервисов; <br />
      3.2.6. связи с Покупателем, в том числе направление уведомлений, запросов
      и информации, касающихся использования Сервисов, оказания услуг, а также
      обработки запросов и заявок от Покупателя; <br />
      3.2.7. улучшения качества Сервисов, удобства их использования, разработка
      новых Сервисов и услуг; <br />
      3.2.8. информирования Покупателя о проводимых мероприятиях и акциях;
      <br />
      3.2.9. проведения статистических и иных исследований на основе неличных
      данных, а также оптимизации рекламных сообщений. <br />
      3.3. Продавец не несет ответственности за сведения, предоставленные
      Покупателем на интернет-сайте в общедоступной форме. <br />
      3.4. Продавец не несет ответственности за убытки, которые Покупатель может
      понести в результате того, что его логин и пароль стали известны третьему
      лицу. <br />
      <br />
      4. Права и обязанности сторон <br />
      4.1. Покупатель обязан: <br />
      4.1.1. предоставлять информацию о персональных данных, необходимую для
      пользования Интернет-магазином; <br />
      4.1.2. изменять, дополнять предоставленную информацию в случае обнаружения
      некорректных данных при пользовании Интернет-магазином. 4.2. Покупатель
      имеет право: <br />
      4.2.1. на доступ и редактирование информации о персональных данных в любое
      время через веб-интерфейс, предоставляемый в рамках сервисов. <br />
      4.3. Продавец обязан: <br />
      4.3.1. использовать полученную информацию исключительно для целей,
      указанных в разделе 3 настоящей Политики конфиденциальности; <br />
      4.3.2. обеспечить хранение конфиденциальной информации в тайне, не
      разглашать без предварительного письменного разрешения Покупателя
      переданных персональных данных, за исключением передачи данных в целях
      выполнения заказа Покупателя (курьерским службам, организациям почтовой
      связи, банкам и т.п.), а также уполномоченным государственным органам
      Республики Казахстан в порядке, установленным законодательством РК; <br />
      4.3.3. принимать меры предосторожности для защиты конфиденциальности
      персональных данных Покупателя согласно порядку, обычно используемого для
      защиты такого рода информации. <br />
      4.4. Продавец имеет право предоставлять доступ для сбора и анализа
      неличных данных Покупателей третьим лицам для целей статистики и
      оптимизации рекламных сообщений. Использование неличных данных третьими
      лицами регулируется их собственными политиками конфиденциальности, и
      Интернет-магазин не несет ответственности за их использование. <br />
      <br />
      5. Прочие условия <br />
      5.1. <br />
      Пользование Покупателем Интернет-магазином означает его безоговорочное
      согласие с настоящей Политикой конфиденциальности и условиями обработки
      Продавцом персональных данных Покупателя. <br />
      5.2. В случае несогласия с условиями Политики конфиденциальности
      Покупатель должен прекратить пользование Сайтом, Интернет-магазином.{" "}
      <br />
      5.3. Настоящая Политика конфиденциальности применяется только к сайту
      Интернет-магазина http://www.pizzeria-almaty.kz и поддоменам.
      Интернет-магазин не несет ответственность за сайты третьих лиц, на которые
      Покупатель может перейти по ссылкам, доступным на сайте Интернет-магазина.
      <br />
      5.4. Продавец, в силу специфики способа получения информации, не проверяет
      достоверность предоставленных Покупателем персональных данных и не
      осуществляет контроль их актуальности. Однако, Продавец исходит из того,
      что Покупатель предоставляет достоверные персональные данные и
      поддерживает эти данные в актуальном состоянии. Всю ответственность, а
      также возможные последствия за предоставление недостоверных или не
      актуальных персональных данных несёт Покупатель. <br />
      5.5. Отключение Сookies может повлечь невозможность доступа к частям сайта
      Интернет-магазина, требующим авторизации. <br />
      5.6. Интернет-магазин осуществляет сбор статистики об IP-адресах своих
      Покупателей. Данная информация используется с целью выявления и решения
      технических проблем, для контроля законности проводимых финансовых
      платежей. <br />
      5.7. К настоящей Политике конфиденциальности и отношениям между
      Покупателем и Продавцом применяется действующее законодательство
      Республики Казахстан. <br />
      5.8. Продавец оставляет за собой право на одностороннее изменение
      настоящей Политики конфиденциальности для дальнейшего совершенствования
      системы безопасности в соответствии с действующим законодательством РК.
      <br />
      5.9. Все предложения или вопросы по поводу настоящей Политики
      конфиденциальности следует сообщать по адресу: symbat.mavl@gmail.com
      <br />
      5.10. Продавец не несет ответственности за действия третьих лиц,
      получивших в результате использования Интернета доступ к информации о
      Покупателе, за последствия использования информации, которая доступна
      любому пользователю сети Интернет.
    </div>
  );
};

export default OfferPage;
