import { FontAwesomeIcon } from "@fortawesome/react-fontawesome";
import { faArrowLeft } from "@fortawesome/free-solid-svg-icons";
import { useNavigate } from "react-router-dom";

const PrivacyPolicy = () => {
  const navigate = useNavigate();

  return (
    <div className="text- my-[40px] px-[30px]">
      <div
        onClick={() => navigate("/cart")}
        className="fixed left-[20px] top-[15px] rounded-full px-[16px] py-[11px] text-xl backdrop-blur backdrop-filter"
      >
        <FontAwesomeIcon icon={faArrowLeft} />
      </div>
      <p className="py-[10px] text-center font-bold">
        ПУБЛИЧНЫЙ ДОГОВОР-ОФЕРТА
        <br />
        Юридического лица ИП Мавлянова С.Р.
        <br />
        (далее – Исполнитель)
      </p>
      Настоящая публичная оферта (далее – Оферта), является Договором,
      заключенным между Исполнителем и пользователем услуг - физическим лицом
      (далее - Заказчик), который определяет условия приобретения и оказания
      услуг с использованием ресурсов Исполнителя.
      <br />
      <br />
      <p className="py-[10px] text-center font-bold">1. ОБЩИЕ ПОЛОЖЕНИЯ</p>
      1.1. Исполнитель публикует настоящую Оферту с предложением в адрес
      физических и юридических лиц в соответствии со ст.395, 396 и 447
      Гражданского кодекса Республики Казахстан (далее – ГК РК).
      <br />
      1.2. Настоящая Оферта, как и любой Договор, определяет существенные
      условия взаимодействия между Исполнителем и Заказчиком (лицом
      акцептовавшим Оферту).
      <br />
      1.3. Настоящая Оферта заключается между Исполнителем и Заказчиком в момент
      оформления заказа на оказание услуг.
      <br />
      1.4. Оферта может быть принята любым физическим или юридическим лицом на
      территории Республики Казахстан, имеющим намерение заказать (приобрести)
      услуги, оказываемые Исполнителем в соответствии с перечнем услуг,
      указанных на сайте pizzeria-almaty.kz.
      <br />
      1.5. Заказчик безоговорочно принимает все условия, содержащиеся в оферте в
      целом (т.е. в полном объеме и без исключений).
      <br />
      1.6. В случае принятия условий настоящей Оферты, физическое или
      юридическое лицо, становится Заказчиком.
      <br />
      1.7. Акцептом является получение Исполнителем сообщения о намерении
      физического или юридического лица заказать услуги на условиях,
      предложенных настоящей Офертой.
      <br />
      1.8. Оферта, все изменения, приложения к ней, а также вся дополнительная
      информация об услугах Исполнителя опубликованы на сайте
      pizzeria-almaty.kz.
      <br />
      <br />
      <p className="py-[10px] text-center font-bold">
        2. СТАТУС САЙТА ИСПОЛНИТЕЛЯ
      </p>
      2.1. Сайт является собственностью Исполнителя и предназначен для
      организации дистанционного способа продажи услуг посредством сети
      интернет.
      <br />
      2.2. Произведя акцепт Оферты (т.е. оплату оформленного на сайте
      Исполнителя заказа), Заказчик получит услуги на условиях и в порядке,
      определенном Договором на оказание услуг Исполнителя, размещенного на
      сайте pizzeria-almaty.kz.
      <br />
      2.3. Исполнитель не несет ответственности за содержание и достоверность
      информации, предоставленной Заказчиком при оформлении заказа на сайте
      Исполнителя.
      <br />
      <br />
      <p className="py-[10px] text-center font-bold">3. СТАТУС ЗАКАЗЧИКА</p>
      3.1. Заказчик несет ответственность за достоверность предоставленной при
      оформлении заказа информации, и ее чистоту от претензий третьих лиц.
      <br />
      3.2. Заказчик подтверждает свое согласие с условиями, установленными
      настоящей Офертой, путем проставления отметки в графе «Условия Договора
      мною прочитаны полностью, все условия Договора мне понятны, со всеми
      условиями Договора я согласен» при оформлении заказа.
      <br />
      3.3. Информация, предоставленная Заказчиком, является конфиденциальной.
      Заказчик, предоставляя свои персональные данные, зарегистрировавшись на
      сайте или заполнении заявки дает своими действиями согласие на обработку
      его персональных данных в целях исполнения пользовательского соглашения.
      Исполнитель использует информацию о Заказчике исключительно в целях
      функционирования Исполнителя (отправление уведомления Заказчиком о
      выполнении заказа и т.д.) и в случаях, указанных в настоящей Оферте.
      <br />
      3.4. Услуги приобретаются Заказчиком исключительно для личных, семейных,
      домашних нужд, не связанных с осуществлением предпринимательской
      деятельности. Использование сайта (ресурса) Исполнителя для просмотра и
      выбора услуг, а также для оформления заказа является для Заказчика
      безвозмездным.
      <br />
      <p className="py-[10px] text-center font-bold">4. ПРЕДМЕТ ОФЕРТЫ</p>
      4.1. Исполнитель, на основании заказов Заказчика, продает последнему
      услуги в соответствии с условиями и по ценам, установленным Исполнителем
      на сайте.
      <br />
      4.2. Оказание услуг заказанных и оплаченных Заказчиком, осуществляется
      Исполнителем или третьими лицами, привлеченными Исполнителем для
      исполнения своих обязательств.
      <br />
      4.3. К отношениям между Заказчиком и Исполнителем применяются положения ГК
      РК, ЗРК «О защите прав потребителей», а также иные нормативные правовые
      акты Республики Казахстан, регулирующие указанные в настоящей Оферте права
      и обязанности Сторон.
      <br />
      4.4. Физическое или юридическое лицо считается принявшим все условия
      Оферты (акцепт) и приложений к ней в полном объеме и без исключений с
      момента получения Исполнителем сообщения о намерении Заказчика заказать
      услуги на условиях, предложенных Исполнителем. В случае акцепта Оферты
      физическое или юридическое лицо считается заключившим с Исполнителем
      Договор оказания услуг и приобретает статус Заказчика.
      <br />
      <br />
      <p className="py-[10px] text-center font-bold">
        5. ПОРЯДОК ЗАКЛЮЧЕНИЯ ДОГОВОРА КУПЛИ-ПРОДАЖИ
      </p>
      5.1. Заказчик может оформить заказ самостоятельно на сайте Исполнителя,
      либо через специалиста Исполнителя по телефону, указанному на сайте, на
      условиях Договора оказания услуг.
      <br />
      5.2. При оформлении заказа на сайте Исполнителя, Заказчик обязан
      предоставить следующие данные: • Ф.И.О., ИИН (для физических лиц) или
      полное наименование, БНН (для юридических лиц); • адрес доставки Товара; •
      контактный телефон и адрес электронной почты Заказчика.
      <br />
      5.3. Волеизъявление Заказчика осуществляется посредством внесения
      последним соответствующих данных в форму заказа на сайте Исполнителя, либо
      подачей заявки через специалиста Исполнителя с использованием
      информационно-телекоммуникационных средств или по электронной почте
      (e-mail).
      <br />
      5.4. Исполнитель не редактирует информацию о Заказчике.
      <br />
      5.5. Для получения бумажного экземпляра Договора оказания услуг, Заказчик
      отправляет заявку по электронной почте или иным способом, согласованным со
      специалистом Исполнителя по телефону, указанному на сайте Исполнителя.
      <br />
      <br />
      <p className="py-[10px] text-center font-bold">6. ИНФОРМАЦИЯ О ТОВАРЕ</p>
      6.1. Информация об услугах Исполнителя, предоставляются к показу на сайте
      Исполнителя через графические изображения и информацию, являющиеся
      собственностью Исполнителя.
      <br />
      6.2. Каждое графическое изображение, сопровождается текстовой информацией
      с наименованием, ценой и описанием услуг.
      <br />
      6.3. Все информационные материалы, представленные на сайте Исполнителя,
      носят справочный характер и не могут в полной мере передавать информацию о
      свойствах и характеристиках услуг. В случае возникновения у Заказчика
      вопросов, касающихся свойств и характеристик услуг, Заказчик должен перед
      оформлением заказа обратиться к специалисту Исполнителя по телефонам
      указанным на сайте.
      <br />
      6.4. По просьбе Заказчика специалист Исполнителя обязан предоставить (по
      телефону или посредством электронной почты) прочую информацию, необходимую
      и достаточную, с точки зрения Заказчика, для принятия им решения о заказе
      услуг.
      <br />
      <br />
      <p className="py-[10px] text-center font-bold">
        7. ПОРЯДОК ПРИОБРЕТЕНИЯ (ЗАКАЗА) УСЛУГ
      </p>
      7.1. Заказчик вправе оформить заказ на любой из видов услуг,
      предоставленных на сайте Исполнителя. Каждый вид услуги может быть заказан
      в любом количестве. Исключения из указанного правила указаны в описании
      каждого вида услуг.
      <br />
      7.2. Заказ может быть оформлен Заказчиком по телефонам, указанным на
      сайте, или оформлен самостоятельно на сайте.
      <br />
      7.3. После оформления заказа Исполнитель подтверждает заказ Заказчика
      путем отправления на e-mail Заказчика информацию, подтверждающую принятие
      заказа, с указанием наименования, вида и характеристик услуг с указанием
      общей суммы заказа или специалист Исполнителя связывается с Заказчиком по
      телефону для уточнения необходимых характеристик услуг.
      <br />
      7.4. При невозможности оказания услуги, представленной на сайте
      Исполнителя, специалист последнего обязан поставить в известность об этом
      Заказчика (по телефону или посредством электронной почты).
      <br />
      7.5. Срок оказания услуги устанавливается по соглашению Сторон и/или
      определяется Договором об оказании услуг, размещенном на сайте
      Исполнителя.
      <br />
      <br />
      <p className="py-[10px] text-center font-bold">8. ЦЕНА УСЛУГ</p>
      8.1. Цена указанная на сайте Исполнителя указана в тенге Республики
      Казахстан.
      <br />
      8.2. Указанная на сайте цена может быть изменена Исполнителем в
      одностороннем порядке, при этом цена на заказанные и оплаченные Заказчиком
      услуги изменению не подлежит.
      <br />
      8.3. Стоимость услуг, предоставляемых Заказчику при их заказе на сайте
      Исполнителя указана в разделе «Оплата».
      <br />
      <br />
      <p className="py-[10px] text-center font-bold">9. ОПЛАТА УСЛУГ</p>
      9.1. Способы и порядок оплаты указаны на сайте в разделе «Оплата». При
      необходимости порядок и условия оплаты заказа оговариваются Заказчиком со
      специалистом Исполнителя.
      <br />
      9.2. При наличной форме оплаты Заказчик обязан уплатить Исполнителю цену
      заказа в момент выставления и передачи Заказчику счета на оплату услуг,
      путем передачи денег представителю Исполнителя.
      <br />
      9.3. Оплата безналичным расчетом производится согласно оформленному счёту
      в течение 3 (трёх) рабочих дней с даты выставления такого счёта. После
      поступления денежных средств на счет Исполнителя, специалист Исполнителя
      согласовывает с Заказчиком сроки оказания услуг. При безналичной форме
      оплаты обязанность Заказчика по уплате цены заказа считается исполненной с
      момента зачисления соответствующих денежных средств на расчетный счет,
      указанный Исполнителем.
      <br />
      9.4. Заказчик оплачивает заказ любым способом, доступным на сайте
      Исполнителя.
      <br />
      9.5. Расчеты Сторон при оплате заказа осуществляются в тенге Республики
      Казахстан.
      <br />
      <br />
      <p className="py-[10px] text-center font-bold">10. ВОЗВРАТ ТОВАРА</p>
      10.1. Заказчик вправе отказаться от услуг в порядке и на условиях,
      предусмотренных ЗРК «О защите прав потребителей РК».
      <br />
      10.2. Заказчик не вправе отказаться от услуг выполненных (оказанных)
      надлежащим образом.
      <br />
      10.3. При отказе Заказчика от услуг Исполнитель возвращает Заказчику
      сумму, уплаченную Исполнителем в соответствии с договором, за исключением
      расходов Исполнителя.
      <br />
      <br />
      <p className="py-[10px] text-center font-bold">
        11. ОТВЕТСТВЕННОСТЬ СТОРОН
      </p>
      11.1. Стороны несут ответственность в соответствии с законодательством РК.
      <br />
      11.2. Исполнитель не несет ответственности за ущерб, причиненный Заказчику
      вследствие ненадлежащего использования им результатов услуг, заказанных на
      сайте Исполнителя.
      <br />
      11.3. Стороны освобождаются от ответственности за неисполнение или
      ненадлежащее исполнение обязательств по Оферте на время действия
      обстоятельств непреодолимой силы.
      <br />
      <br />
      <p className="py-[10px] text-center font-bold">12. ПРОЧИЕ УСЛОВИЯ</p>
      12.1. К отношениям между Заказчиком и Исполнителем применяются нормы,
      определенные законодательством Республики Казахстан.
      <br />
      12.2. При необходимости Исполнитель и Заказчик вправе в любое время
      оформить договор оказания услуг в форме письменного двухстороннего
      соглашения, не противоречащего положениям настоящей Оферты.
      <br />
      12.3. В случае возникновения вопросов и претензий со стороны Заказчика,
      последний должен обратиться к Исполнителю по адресу местонахождения
      Исполнителя _____, и/или по адресу электронной почты: _____ и/или по
      номеру телефона: _____, в том числе определенным на сайте Исполнителя.
      <br />
      12.4. Настоящая Оферта вступает в силу с даты её акцепта Заказчиком и
      действует до полного исполнения обязательств Сторонами по ней.
      <br />
      12.5. Все споры и разногласия, возникающие при исполнении Сторонами
      обязательств по настоящей Оферте, решаются путем проведения переговоров, а
      в случае невозможности их урегулирования посредством переговоров, Стороны
      имеют право обратиться за разрешением таких споров в судебные органы
      республики Казахстан по месту нахождения Исполнителя.
      <br />
      12.6. Исполнитель оставляет за собой право расширять и сокращать общее
      предложение услуг на сайте, регулировать доступ к заказе любых услуг, а
      также приостанавливать или прекращать продажу любых услуг по своему
      собственному усмотрению.
      <br />
      <br />
      <p className="py-[10px] text-center font-bold">
        13. АДРЕС И РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ
      </p>
      Наименование: ИП Мавлянова С.Р.
      <br />
      Юридический адрес: г. Алматы, ул.Прокофьева 140
      <br />
      БИН: 900125450992 р/с в тенге: KZ62722S000005896714 в банке: АО "Kaspi
      Bank"
      <br />
      БИК: CASPKZKA
      <br />
      БИН банка: 971240001315
    </div>
  );
};

export default PrivacyPolicy;
